Repository: liraymond04/lotm-subs
Catalog: omegat/tm/ep12-omegat-omegat.tmx
Source language: zh_cn
Languages: en_us

source: 2-105血管小偷对高序列强者实测有效
en_us: 2-105, Blood Vessel Thief, is tested to be effective on High-Sequence Beyonders.

source: 一定是这样的
en_us: Of course it's like this!

source: 一是队友死后
en_us: The first was after our teammates die,

source: 一杯温水
en_us: A cup of warm water.

source: 上次没来得及开灵视
en_us: Last time I didn't have time to activate Spirit Vision.

source: 不
en_us: No,

source: 不可直视神
en_us: "Do not look directly at God!"

source: 不对
en_us: That's not right.

source: 不应该的
en_us: It shouldn't be.

source: 不得救免
en_us: there is no salvation.

source: 不断天折的童工
en_us: Child laborers that die before their time.

source: 不是幻觉
en_us: It wasn't a hallucination.

source: 不是说孩子出生了
en_us: Didn't you say if the child was born...

source: 不知道为什么
en_us: I don't know why,

source: 不能看
en_us: Don't look!

source: 不要太担心了
en_us: Don't be so worried,

source: 不要犯傻
en_us: Don't be foolish!

source: 与兰尔乌斯案
en_us: and the Lanevus case

source: 为了孩子
en_us: for this child,

source: 为什么
en_us: Why?

source: 为什么又是这样
en_us: Why is it like this again?

source: 为什么总是有危险
en_us: Why is there always danger?

source: 为什么要成为非凡者
en_us: Why would you become a Beyonder?

source: 之前命令我下楼善后
en_us: Earlier you ordered me to go downstairs and handle the aftermath,

source: 也不会减少
en_us: and are never reduced.

source: 也不知道队长处于什么状态
en_us: I also don't know what state the Captain is in.

source: 也是队长提议使用的
en_us: it was also the Captain who suggested using it.

source: 也许就是一个潜藏的异种
en_us: might be a potential Mutant.

source: 也许老尼尔也受到了“”的催化
en_us: It's possible Old Neil also suffered from "His" catalysis.

source: 二是
en_us: The second was,

source: 于迷雾中自由漫步手握光之杯盏
en_us: To be free in mist to hold a cup of light

source: 亲手铸就的蒸汽与机械时代
en_us: and personally ushered in the Age of Steam and Machinery,

source: 亵渎之罪
en_us: The crime of blasphemy―—

source: 人类通过服食魔药
en_us: Humanity through consuming potions

source: 从华尔兹到库朗舞
en_us: From the waltz to the courante,

source: 从序列九开始
en_us: start from Sequence 9.

source: 他
en_us: Who

source: 他一定会回来
en_us: he'll definitely come back!

source: 他上个月才订婚
en_us: He was engaged just last month.

source: 他从来没有告诉过我
en_us: He's never told me that before!

source: 他出现失控的前期征兆了
en_us: He's showing early signs of losing control!

source: 他只邀请了我
en_us: he only invited me.

source: 他对我很好
en_us: He was very good to me.

source: 他就会回来找你
en_us: he'll come back to find you.

source: 他就消失了
en_us: he just disappeared.

source: 他很优秀
en_us: He was outstanding,

source: 他很喜欢这个孩子的
en_us: He really loves this child...

source: 他是骗子
en_us: he's a swindler.

source: 他的每一句话都让我开心
en_us: Every word he said made me happy.

source: 他的诞生
en_us: His birth

source: 他说
en_us: He said

source: 他送了我一根项链
en_us: He gave me a necklace.

source: 令凡人之躯
en_us: and a mortal body,

source: 以微弱之光
en_us: With fragile light

source: 优秀的占卜家先生
en_us: Mr. Outstanding Seer!

source: 会让我陷入危险之中
en_us: will lead me to danger.

source: 会随着时间推移不断变强的炸弹
en_us: a bomb that will continue to grow stronger as time goes on!

source: 伦纳德找到了兰尔乌斯的住所
en_us: Leonard found Lanevus' residence.

source: 但不知道为什么
en_us: But I don't know why

source: 但已经很久没回来了
en_us: but it's already been a long time since he's come back.

source: 但我记得
en_us: But I recall

source: 但我还是做了这样的选择
en_us: But I still made this choice

source: 但无论哪种
en_us: But no matter which,

source: 但是几率较小
en_us: But the probability is comparatively smaller.

source: 但灵性警示我
en_us: but my spirituality warned me,

source: 但祭坛在哪儿
en_us: But where's the altar?

source: 但邪恶组织
en_us: but the evil organizations

source: 佐特兰街去见朋友
en_us: go to Zouteland Street to see some friends...

source: 何处有钥匙从骨血里凿出真相
en_us: Where are the flames that come in fury?

source: 你
en_us: You!

source: 你们从胡德·欧根那里得到线索
en_us: You guys found a clue from Hood Eugen

source: 你们好
en_us: Hello.

source: 你们就可以帮我更快地生下孩子
en_us: you guys could help me give birth to my child faster!

source: 你们知道很多
en_us: you guys know a lot.

source: 你到这儿来有什么事吗
en_us: What brings you here?

source: 你和兰尔乌斯先生
en_us: you and Mr. Lanevus

source: 你守在这里
en_us: You guard here.

source: 你拿两件攻击性强的封印物
en_us: Go grab two offensive Sealed Artifacts.

source: 你描述的场景
en_us: The scenario you described

source: 你最好小心
en_us: You'd best be careful.

source: 你最近是不是很忙
en_us: Have you been busy lately?

source: 你有什么委托吗
en_us: Is there something you want to commission?

source: 你的上司
en_us: Your superior

source: 你要咖啡
en_us: do you want coffee

source: 你要尽早习惯这些事
en_us: You have to get used to these sooner or later.

source: 你说她怀的不是兰尔乌斯的孩子
en_us: You're saying the child she's bearing is not Lanevus'.

source: 信已经寄出了
en_us: The letter's already been sent.

source: 做好准备
en_us: prepare yourselves!

source: 克莱恩
en_us: Klein.

source: 克莱恩·莫雷蒂
en_us: Klein Moretti?

source: 兰尔乌斯
en_us: Lanevus.

source: 兰尔乌斯先生
en_us: Mr. Lanevus...

source: 兰尔乌斯描写的怨念
en_us: The description that Lanevus wrote

source: 兰尔乌斯的事
en_us: about Lanevus.

source: 兰尔乌斯的未婚妻
en_us: Lanevus's fiancee.

source: 兰尔乌斯设的炸弹不在祭坛
en_us: The bomb that Lanevus set isn't on the altar...

source: 关于兰尔乌斯先生的行踪
en_us: Regarding Mr. Lanevus' whereabouts,

source: 其中两件对高序列强者效果未知
en_us: Two of them have unknown effectiveness on High-Sequence Beyonders.

source: 其实不是的
en_us: But it wasn't like that!

source: 其实是遇到了一些困难
en_us: has actually been going through some difficulties,

source: 再去仔细核查
en_us: examine them again carefully.

source: 再等几天吗
en_us: Wait a few days?

source: 再过几天兰尔乌斯就回来了
en_us: In a few days Lanevus will come back!

source: 冷静
en_us: Calm down,

source: 凡是触碰到2-105的人
en_us: Every person that touches 2-105

source: 出什么事了
en_us: What happened?

source: 切记
en_us: Remember clearly,

source: 刚才是幻觉
en_us: Was that a hallucination?

source: 别让悲伤过度消耗心神
en_us: Don't let sorrow drain your spirit too much.

source: 化生迎接降临的容器
en_us: to create a vessel to welcome the descent!

source: 半小时
en_us: half an hour.

source: 单靠我们
en_us: Relying just on us...

source: 占卜失败
en_us: so the divination failed...

source: 厨房里有早餐你要不要吃点
en_us: There's breakfast in the kitchen, do you want to eat a bit?

source: 去寻找它吧
en_us: Go find it then,

source: 去豪尔斯街六十二号
en_us: Head to 62 Howes Street.

source: 又是信
en_us: A letter {\i1}again{\i0}.

source: 取走您孩子头骨的幕后黑手
en_us: that made my fate disharmonious and stole the skull of your child

source: 变异的太阳圣徽
en_us: Mutated Sun Sacred Emblem.

source: 只是从一个承载物转移到另一个承载物
en_us: It’s only passed from one carrier to the next.

source: 只有你们能给我答案了
en_us: Only you two can give me answers.

source: 只要再等几天
en_us: You only need to wait a few days!

source: 只要有孩子
en_us: as long I have the child,

source: 可以拥有比肩神明的力量
en_us: can possess power comparable to gods.

source: 可是
en_us: But

source: 可是那次之后
en_us: But after that time,

source: 可能要出现了
en_us: might have appeared!

source: 各位朋友
en_us: dear friends.

source: 同时
en_us: At the same time,

source: 同途径
en_us: for those of the same Pathway,

source: 后来他们却告诉我
en_us: Later they told me

source: 向代罚者和机械之心求援
en_us: And also from the Mandated Punishers and the Machinery Hivemind.

source: 听说
en_us: I heard

source: 启动战时紧急条款
en_us: during emergencies I have the authority to

source: 吸食入体
en_us: to consume their bodies.

source: 和他们永远在一起
en_us: to be with them forever.

source: 和兰尔乌斯许诺欧根的一点神性
en_us: and the divinity Lanevus promised Eugen.

source: 回来啦克莱恩
en_us: You're back, Klein.

source: 圣堂回电
en_us: The Holy Cathedral sent back a telegram.

source: 圣堂让我们立誓保密
en_us: the Holy Cathedral immediately made us swear an oath of secrecy

source: 圣赛琳娜
en_us: {\i1}Saint Selena...

source: 圣赛琳娜骨灰
en_us: Saint Selena's ashes.

source: 圣骨灰
en_us: Saint's ashes?

source: 在哪个地方
en_us: where is the bomb?

source: 在我这里
en_us: is here with me.

source: 在特定状况下变成的怪物
en_us: transform into monsters under specific circumstances.

source: 在神秘领域
en_us: In the field of mysticism,

source: 在科恩黎·怀特的尸体上
en_us: over the corpse of Kenley White...

source: 在虚无中刻下我未竟的名章
en_us: Into the dark to dream and scream my name

source: 坠入黑暗且让梦与呐喊
en_us: Where are the keys that carve truth from me?

source: 天然的吸血鬼在巨龙和巨人退出历史的舞台前
en_us: Natural vampires were already on the brink of extinction before the dragons and giants bowed out of the stage of world history,

source: 太明显
en_us: It's too obvious.

source: 太直接
en_us: Too direct.

source: 女士
en_us: Madam.

source: 她之前似乎精神出了点问题
en_us: Before she had some issues with her mental health.

source: 她的精神状态已经撑不了多久了
en_us: Her mental state already can't hold on for much longer.

source: 她的精神问题愈发恶化了啊
en_us: Her mental health seems to have worsened...

source: 她让我自己给你解释
en_us: She told me to explain myself to you.

source: 好
en_us: Okay.

source: 好像有人告诉过我
en_us: It seems like there was someone that told me

source: 如果圣堂的强援还没有抵达
en_us: If the Holy Cathedral's reinforcements haven't arrived,

source: 如果我从占卜自己的安危这方面入手
en_us: If I start from the aspect of divining my {\i1}own{\i0} safety...

source: 如果游戏失败
en_us: If you fail the game...

source: 存在一个定律
en_us: there exists a law.

source: 孩子
en_us: child.

source: 它昨天已被贝克兰德借走
en_us: It was already lent to Backlund yesterday.

source: 完成生命层次的晋升
en_us: completing their promotion to life's natural order.

source: 对铜哨的压制减弱了
en_us: the supression on the copper whistle will weaken!

source: 封印核心被取走
en_us: The core seals have been retrieved.

source: 将在这样的背景下开始
en_us: shall take place in this kind of setting.

source: 将成为邪恶存在
en_us: but will this only become the hotbed for the descent

source: 小子
en_us: Little one!

source: 小心孩子
en_us: Careful with your child.

source: 就会死
en_us: you'll die!

source: 就已经接近灭绝
en_us: so already close to extinction.

source: 就有个声音
en_us: There's just a voice...

source: 就能找到兰尔乌斯
en_us: I can find Lanevus!

source: 尽量拖延
en_us: Stall for as much time as possible.

source: 差点忘了
en_us: I almost forgot.

source: 已经完全不掩饰了
en_us: It’s already completely no longer hidden.

source: 帅气又多金
en_us: elegant and wealthy,

source: 希望梅高欧丝肚子里的降临体还能等待
en_us: Let's hope the descended body in Megose's stomach can wait.

source: 希望阿兹克先生和戴莉女士能尽快回信
en_us: I hope Mr. Azik and Madam Daly can reply as soon as possible.

source: 常常带我去参加他与朋友的聚会
en_us: He frequently brought me to attend meetings with his friends!

source: 序列八的极限是
en_us: the limit for a Sequence 8 is

source: 序列四的神话生物
en_us: Sequence 4 Demigod.

source: 序列数字越低
en_us: The lower the Sequence number,

source: 应该接受父亲与母亲共同的祝福
en_us: will definitely bring blessings to both his mother and father!

source: 廷根中心地下
en_us: Under the center of Tingen...

source: 廷根危机
en_us: can the Tingen crisis

source: 廷根毁灭日有关
en_us: is related to Tingen's end of days.

source: 开启
en_us: rises!

source: 异种的话
en_us: Regarding Mutants,

source: 弗莱和洛耀呢
en_us: What about Frye and Royale?

source: 强援速到
en_us: Strong reinforcements are coming immediately.

source: 当时有很多漂亮女孩期待和他跳舞
en_us: At that time there were so many beautiful girls waiting to dance with him.

source: 当时这是必然的选择
en_us: It was a logical decision back then!

source: 当然
en_us: Of course,

source: 很多地方
en_us: in so many places,

source: 必须立刻向圣堂求援
en_us: I need to ask for assistance from the Holy Cathedral immediately.

source: 快走
en_us: Go!

source: 快降生了
en_us: It's about to be born!

source: 忽然就想着上来看一看
en_us: and suddenly thought of coming up to take a look.

source: 怀疑兰尔乌斯与西里斯有关系
en_us: and suspected that Lanevus was connected to Sirius.

source: 怎么了
en_us: What's wrong.

source: 怎么回事
en_us: What's going on?

source: 怎么查到的
en_us: How did you figure it out?

source: 情况很危急
en_us: so the situation is desperate.

source: 惊叹抑或惶惑
en_us: Wonder or dismay

source: 想想你们的孩子
en_us: Think of your child!

source: 愿女神庇佑你们
en_us: May the Goddess bless you all.

source: 愿女神庇护你
en_us: May the Goddess bless you.

source: 我
en_us: I

source: 我不清楚发生了什么事情
en_us: I'm not clear on the things that have occurred.

source: 我不知道他们的真实意愿
en_us: I don't know their true wishes.

source: 我亲手开启的工业革命
en_us: I started the Industrial Revolution with my own hands

source: 我从没听说过
en_us: I've never heard of

source: 我以廷根值夜者小队队长的名义
en_us: As Captain of the Tingen Nighthawks,

source: 我们得马上回去告诉队长
en_us: We have to hurry back and tell the Captain.

source: 我们才搜到兰尔乌斯的信
en_us: We only just searched Lanevus' letter

source: 我们的游戏
en_us: Our game

source: 我们确实掌握了一些新线索
en_us: we actually got our hands on some new clues.

source: 我会将注意事项
en_us: I'll keep that in mind,

source: 我先上去
en_us: I'll go up first.

source: 我发誓守护我所留存的世界
en_us: I vow to guard a world I stay

source: 我另有打算
en_us: I have other plans.

source: 我只要来这里
en_us: if I just came here

source: 我同意你的猜测
en_us: I agree with your guess.

source: 我和戴莉发现这点时
en_us: When Daly and I noticed this,

source: 我在廷根中心安放了一个炸弹
en_us: I've placed a bomb in the middle of Tingen,

source: 我在想什么
en_us: What am I thinking?

source: 我就知道我这一生再也离不开他了
en_us: I knew I never wanted to leave him in my life.

source: 我忽然就想着到佐特兰街来
en_us: I suddenly thought of coming to Zouteland Street

source: 我怀疑梅高欧丝肚子里的是
en_us: I suspect what's in Megose's stomach is

source: 我怀疑这里
en_us: I suspect this place

source: 我想聊聊
en_us: I want to chat

source: 我找了很久
en_us: I've looked for so long,

source: 我挨个排查
en_us: so I searched every one of them.

source: 我有点儿累了
en_us: I'm a little tired.

source: 我申请使用3-0782
en_us: I'll apply to use 3-0782,

source: 我申请启用封印核心
en_us: I'll apply to use the core seals,

source: 我的
en_us: My

source: 我的孩子
en_us: My child!

source: 我知道了
en_us: I got it,

source: 我试图开启灵视
en_us: I attempted to activate Spirit Vision

source: 或许就是炸弹不断变强的力量源泉
en_us: might be the energy source that constantly strengthens the bomb.

source: 戴莉给你的回信
en_us: The letter Daly gave you

source: 所以跟踪梅高欧丝的弗尔安先生
en_us: So that's why Mr. Havre, who was tailing Megose,

source: 才不得不离开廷根的
en_us: which is why he was forced to leave Tingen.

source: 才会无故失控
en_us: would suddenly lose control.

source: 指引我阴影之路
en_us: Guide my shadow way

source: 指认六十二号租客和他很像
en_us: and felt that he looked similar to the resident at number 62,

source: 据克莱恩对雪伦·霍伊的通灵显示
en_us: According to Klein's mediumship of Sharon Khoy,

source: 掌握不同的非凡能力
en_us: harnessed various Beyonder abilities,

source: 搅动还是迟疑
en_us: Stirring or delay

source: 整个廷根
en_us: The whole of Tingen

source: 整晚他都和我在一起
en_us: he was with me the whole night!

source: 文职全部撤离
en_us: All civilian posts evacuate.

source: 无边的怨念和灰暗
en_us: Boundless resentment and darkness

source: 时间紧迫
en_us: Time is tight.

source: 明白
en_us: Understood.

source: 是否可以暂时解除
en_us: temporarily be lifted?

source: 是在市议会的舞会上
en_us: at a parliamentary ball.

source: 是当晚女孩们最关注的青年企业家
en_us: that night he was the young entrepreneur all the girls were most interested in.

source: 是滋养圣灵的乳浆与蜜糖
en_us: will be the breastmilk and honey that nourish the Blessed.

source: 是的
en_us: That's right.

source: 是神秘学意义上的炸弹
en_us: It's a bomb related to mysticism.

source: 是谁
en_us: is "he"?

source: 是队长交给科恩黎的
en_us: it was Captain who gave it to Kenley.

source: 暂时还能稳住
en_us: can still be kept stable for the time being.

source: 暗灰低语
en_us: With whispers in gray

source: 最低也是序列四的神话生物
en_us: is also Sequence 4 Demigod at minimum.

source: 最喜欢给朋友们带来惊喜的
en_us: The one who enjoys giving his friends pleasant surprises,

source: 有一条途径的某个序列
en_us: that there's a particular Pathway with some Sequence

source: 有个声音说
en_us: a voice that said...

source: 有人猜测是正常的人类受到了污染或诅咒
en_us: some speculate they are ordinary humans who, after being tainted or cursed,

source: 有位老先生看了兰尔乌斯的照片
en_us: An old man looked Lanevus' picture

source: 有胜算吗
en_us: is there a chance of success?

source: 有资格参与我设计的这场
en_us: You qualify to take part in what I've designed, this

source: 有隐藏密室
en_us: has a hidden secret chamber.

source: 来了
en_us: You're here.

source: 极少活过三十岁的工人
en_us: Workers who seldom live past thirty years old.

source: 某个目标的一项能力
en_us: some abilities from certain targets.

source: 查尼斯门靠你们了
en_us: Chanis Gate is relying on you all now.

source: 梅高欧丝小姐
en_us: Miss Megose!

source: 梅高欧丝就突然上门
en_us: and Megose suddenly appeared at our door.

source: 欺骗了我
en_us: That he deceived me.

source: 此进化路径称为
en_us: This path of evolution is called

source: 死神后裔特性
en_us: Descendant of Death's characteristic

source: 每 一个眼神都让我着迷
en_us: Every expression captivated me.

source: 比如某些不断蓄积着力量的邪恶仪式
en_us: Such as an evil ritual that continuously accumulates power.

source: 永远不会只下一步棋
en_us: will never make just one move.

source: 没什么
en_us: it's nothing.

source: 没什么异常
en_us: nothing is out of the ordinary.

source: 没反应
en_us: No response.

source: 没有回应
en_us: No response.

source: 没睡好
en_us: You didn't sleep well.

source: 没错
en_us: Correct.

source: 涉及真实造物者
en_us: This involves the True Creator

source: 涉及自身安危的占卜
en_us: divination involving one's own safety

source: 渐行渐远
en_us: Fade away

source: 炸弹
en_us: A bomb?

source: 焚毁破碎躯壳铸就新视野
en_us: Burn my broken shell to new sight

source: 爸爸就会回来吗
en_us: his dad would come back?!

source: 现在最需要的就是时间
en_us: Right now what we need the most is time.

source: 现在雪伦·霍伊已死
en_us: Now that Sharon Khoy is dead,

source: 生与死的游戏
en_us: game of life and death.

source: 申请圣赛琳娜骨灰
en_us: apply for Saint Selena's ashes!

source: 疯狂
en_us: Madness,

source: 疾病
en_us: disease,

source: 癫狂还是腐朽
en_us: Madness or Decay

source: 目前廷根只有三件二级封印物
en_us: There are only three Grade 2 Sealed Artifacts in Tingen City at the moment.

source: 看到
en_us: If you look,

source: 看来幕后黑手终于要亲自动手了
en_us: It looks like the mastermind behind the scenes has finally made a move.

source: 真实造物者的降临体
en_us: the descended body of the True Creator.

source: 真实造物者降临体
en_us: The True Creator's descended body

source: 真的吗
en_us: Really?

source: 真的少了些什么
en_us: it's really missing something.

source: 祝贺你们
en_us: Congratulations

source: 神之途径
en_us: the Path of the Divine.

source: 离开
en_us: Leave!

source: 科恩黎
en_us: Kenley...

source: 科恩黎的尸体
en_us: Kenley's corpse,

source: 稳住她
en_us: Keep her stable.

source: 究竟做了什么
en_us: What exactly did you do?

source: 第一次见他
en_us: first met him

source: 第一次见面是在舞会上
en_us: first met at a ball.

source: 等我工作结束
en_us: Wait until my work is over.

source: 等解决了
en_us: Once it's settled,

source: 紧急情况
en_us: It's an emergency situation.

source: 终于找到了这封信
en_us: on finally finding this letter!

source: 终会付出代价
en_us: will eventually pay the price.

source: 终幕
en_us: The final curtain

source: 给了两个选择
en_us: and gave us two choices.

source: 绯红之中
en_us: In the crimson,

source: 而且
en_us: Moreover,

source: 而且危险等级不低
en_us: And the danger level is significant.

source: 而是梅高欧丝身体里的邪恶存在
en_us: it's the sinister existence that's in Megose's body!

source: 联想到欧根心灵世界里的祭台
en_us: Connecting the altar in Eugen's Mind World

source: 肯定
en_us: Positive!

source: 能不断变强的炸弹
en_us: a bomb that can grow stronger.

source: 能窃取一定范围内
en_us: Within a specific range, it can steal

source: 莫雷蒂先生也说过
en_us: Mr. Moretti also said before,

source: 藏着什么
en_us: What are you hiding?

source: 蠢货们
en_us: Fools,

source: 被3-0217反噬牺牲
en_us: died because of 3-0217.

source: 西里斯和豪尔斯街区不少住客有来往
en_us: Sirius had interactions with many of the residents on Howes Street,

source: 要是阿兹克先生还在廷根
en_us: If Mr. Azik is still in Tingen

source: 要给我一个惊喜
en_us: he wanted to give me a surprise.

source: 让你得到真正的安眠
en_us: May you find true peace.

source: 让我命运不协调
en_us: The mastermind behind the scenes

source: 让我想到了吸血鬼和异种
en_us: reminded me of Vampires and Mutants.

source: 让警察部门尽快疏散民众
en_us: Let the police department evacuate the citizens as soon as possible.

source: 诗人同学
en_us: My dear Poet,

source: 该展现你的秘密了
en_us: it’s time for you to show your true secret.

source: 说自己的孩子在娘胎里就会吹口哨
en_us: She says her child sings in her stomach and also whistles.

source: 请稍等
en_us: Please wait a moment,

source: 请问
en_us: May I ask,

source: 谁
en_us: Who.

source: 谁告诉你的
en_us: Who told you that?

source: 豪尔斯街还有他另外的住所吗
en_us: So he has another residence on Howes Street?

source: 贫穷
en_us: Poverty,

source: 走
en_us: Leave!

source: 赶紧通知阿兹克先生
en_us: I need to quickly contact Mr. Azik.

source: 趁着雪伦·霍伊灵体还未消散
en_us: While Sharon Khoy's Spirit Body has not dissipiated yet,

source: 轰
en_us: boom!

source: 还带我去了很多奇妙的地方
en_us: He even brought me to lots of wonderful places.

source: 还是红茶
en_us: or black tea?

source: 还有你们的孩子的
en_us: And your child too.

source: 还没有回来
en_us: They haven't returned yet.

source: 还说
en_us: He even said

source: 这
en_us: This...

source: 这么巧
en_us: Such a coincidence!

source: 这二十二条进阶之路
en_us: These twenty-two paths of advancement

source: 这些都是我的猜测
en_us: these are all my personal guesses.

source: 这会大幅影响魔药消化
en_us: this will substantially disturb my potion digestion.

source: 这座城市的每座工厂
en_us: Every factory in this city

source: 这栋房屋的暗格或者密室
en_us: The secret chamber or hidden compartment in this building.

source: 这说明你们还不算太蠢
en_us: This means that you’re not too stupid.

source: 这说明信息不足
en_us: That means that there was insufficient information,

source: 这邪恶降临体受不了圣骨灰刺激
en_us: The evil descended body can't stand the provokation of the Saint's ashes!

source: 这里很危险
en_us: It's dangerous here.

source: 通常来讲
en_us: Generally speaking,

source: 通灵调查下吧
en_us: you should use mediumship to investigate a bit.

source: 通知所有非战斗人员撤离
en_us: Contact all non-combatants to evacuate.

source: 邓恩·史密斯
en_us: Dunn Smith,

source: 邓恩·史密斯异常的原因
en_us: The reason for Dunn Smith's abnormality.

source: 邓恩·史密斯的异常
en_us: Dunn Smith’s abnormality

source: 那些巧合呢
en_us: What about those coincidences?

source: 那你使用哪件
en_us: Then which one are using?

source: 那天
en_us: That day!

source: 那就血管小偷吧
en_us: Let's go with the Blood Vessel Thief, then.

source: 那时候
en_us: At that time

source: 邪恶降临体
en_us: The evil descended body

source: 邪恶降临体就要降生
en_us: the evil descended body will be born.

source: 都会被偷走生命
en_us: will have their life stolen.

source: 都告诉伦纳德
en_us: and also tell Leonard.

source: 都将化为灰烬
en_us: will be reduced to a ruin.

source: 都找不到他
en_us: and I can't find him!

source: 都笼罩着无数的怨念
en_us: is enveloped in boundless resentment.

source: 都证明你的上司现在状况不稳
en_us: it proves that your superior is in an unstable condition right now,

source: 重生抑或如故
en_us: Rebirth or be same

source: 铜哨被压制了
en_us: The copper whistle is being supressed!

source: 问题是炸弹
en_us: The problem is

source: 队长
en_us: Captain.

source: 队长一直在扮演梦魔
en_us: Captain has been acting as a Nightmare all this time.

source: 队长下令
en_us: Captain’s orders.

source: 队长呢
en_us: Where's the Captain?

source: 队长在吸科恩黎的血
en_us: Captain is drinking Kenley's blood.

source: 队长的异常会让我陷入危险
en_us: Captain’s abnormality will lead me to danger!

source: 队长看起来
en_us: With the Captain, it looks like

source: 阳炎符咒没有被影响
en_us: The Flaring Sun Charm is not affected.

source: 阿兹克先生
en_us: Mr. Azik!

source: 阿兹克先生回信了
en_us: Mr. Azik replied!

source: 降生的温床
en_us: of an Evil God upon this world?!

source: 难道是在胡德·欧根心灵世界的祭台上
en_us: Could it be atop the altar in Hood Eugen's Mind World?

source: 难道是想支开我
en_us: did you want to draw me away?

source: 雪伦·霍伊或许是毁灭日的关键一环
en_us: Sharon Khoy may be a key part of the end of days,

source: 需要你帮忙
en_us: He needs your help.

source: 需要圣堂特批
en_us: requires approval from the Holy Cathedral.

source: 需要的信息最少
en_us: requires the least amount of information.

source: 非凡世界
en_us: The world of Beyonders.

source: 非凡巧合
en_us: An extraordinary coincidence.

source: 非凡特性不会毁灭
en_us: The characteristics of a Beyonder are never destroyed

source: 非凡特性全数上交圣堂
en_us: to hand over all their Beyonder characteristics to the Holy Cathedral.

source: 非凡能力越强
en_us: the greater the Beyonder abilities.

source: 非常危险
en_us: and very dangerous.

source: 顺着这条线
en_us: Follow these clues,

source: 高序列强者
en_us: High-Sequence Beyonders

source: 魔女教派疑似与极光会有合作关系
en_us: the Demoness Sect appears to be collaborating with the Aurora Order,

source: 魔药名称就叫吸血鬼
en_us: whose potion name was called Vampire.
